package java_day02;

public class VariableTest2 {
	public static void main(String[] args) {
		// int 변수 만들기
		int num = 10;
		int Num = 10;// 대문자와 소문자를 구별한다
		int num1 = 10;// 숫자도 쓸 수 있다
		// int 1num = 10; 오류; 숫자로 시작할 수는 없다
		//int st num = 10; 오류; 띄어쓰기는 불가능 하다
		int 숫자 = 10; // 한글 오류는 아니지만 사용하지 말자! (다른개발자를 배려해서!)
		//int *#%^num = 10; 오류; 특수문자는 사용할 수 없다
		int st_num = 10; // _(언더바)만 사용 가능하다
		// int class = 10; //키워드(글자색이 있는 친구)는 사용 불가능
		//----------------------------------------------------
		
		int Num2 = 10; //변수 이름은 대문자로 시작하지 않는다
						// 클래스랑 헷갈리기 때문에
		
		int age = 10;// 의미있는 단어를 사용하여 만든다 (다른 개발자를 배려해서!)
		
		
		
		
		
		
		
		
		
		
		
		
		
 	}
}
